OpenFOAM-v1806/tutorials/multiphase/interFoam/RAS/mixerVesselAMI/Allrun.pre
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

\rm -rf 0

# Meshing
runApplication blockMesh
runApplication surfaceFeatureExtract
runApplication snappyHexMesh -overwrite
runApplication createBaffles -overwrite
runApplication mergeOrSplitBaffles -split -overwrite

# Copy fields after meshing to avoid the generation of unnecessary patch fields
restore0Dir

# Initialize alpha
runApplication setFields

#------------------------------------------------------------------------------
